# Lab SQL 9
In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # to get the password without showing the input
password = getpass.getpass()

········

In [2]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'

engine = create_engine(connection_string)

data = pd.read_sql_query('SELECT * FROM rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

## Create a table `rentals_may` to store the data from rental table with information for the month of May.

In [3]:
query = '''
        CREATE TABLE rentals_may (
        rental_id INT(11) UNIQUE NOT NULL,
        rental_date DATETIME DEFAULT NULL,
        inventory_id MEDIUMINT UNSIGNED DEFAULT NULL,
        customer_id SMALLINT UNSIGNED DEFAULT NULL,
        return_date DATETIME DEFAULT NULL,
        staff_id TINYINT UNSIGNED DEFAULT NULL,
        last_update TIMESTAMP DEFAULT NULL,
        CONSTRAINT PRIMARY KEY (rental_id)
        )
        '''

data = pd.read_sql_query(query, engine)
data.head()

ResourceClosedError: This result object does not return rows. It has been closed automatically.

## Insert values in the table `rentals_may` using the table rental, filtering values only for the month of May.

In [4]:
query = '''
INSERT INTO rentals_may (rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update)
SELECT rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update
FROM rental
where month(rental_date) = 5
'''

data = pd.read_sql_query(query, engine)
data

ResourceClosedError: This result object does not return rows. It has been closed automatically.

## Create a table `rentals_june` to store the data from rental table with information for the month of June.

In [5]:
query = '''
        CREATE TABLE rentals_june (
        rental_id INT(11) UNIQUE NOT NULL,
        rental_date DATETIME DEFAULT NULL,
        inventory_id MEDIUMINT UNSIGNED DEFAULT NULL,
        customer_id SMALLINT UNSIGNED DEFAULT NULL,
        return_date DATETIME DEFAULT NULL,
        staff_id TINYINT UNSIGNED DEFAULT NULL,
        last_update TIMESTAMP DEFAULT NULL,
        CONSTRAINT PRIMARY KEY (rental_id)
        )
        '''

data = pd.read_sql_query(query, engine)
data.head()

ResourceClosedError: This result object does not return rows. It has been closed automatically.

## Insert values in the table `rentals_june` using the table rental, filtering values only for the month of June.

In [8]:
query = '''
INSERT INTO rentals_june (rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update)
SELECT rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update
FROM rental
where month(rental_date) = 6
'''

data = pd.read_sql_query(query, engine)
data

ResourceClosedError: This result object does not return rows. It has been closed automatically.

## Check the number of rentals for each customer for May.

In [26]:
query1 = '''select customer_id, count(rental_id) as nb_cust_may from rentals_may
group by customer_id order by customer_id asc'''

data = pd.read_sql_query(query1, engine)
data

     customer_id  nb_cust_may
0              1            9
1              2            2
2              3            6
3              4            6
4              5            8
..           ...          ...
593          595            3
594          596            8
595          597            5
596          598            1
597          599            5

[598 rows x 2 columns]

## Check the number of rentals for each customer for June.

In [27]:
query2 = '''select customer_id, count(rental_id) as nb_cust_may from rentals_june
group by customer_id order by customer_id asc'''

data = pd.read_sql_query(query2, engine)
data

     customer_id  nb_cust_may
0              1            7
1              2            1
2              3            4
3              4            6
4              5            5
..           ...          ...
585          595            2
586          596            2
587          597            3
588          598            1
589          599            4

[590 rows x 2 columns]

## Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

  - Check the number of rentals for each customer for May
  - Check the number of rentals for each customer for June

    **Hint**: You can store the results from the two queries in two separate dataframes.

In [28]:
df1 = pd.read_sql('''select customer_id, count(rental_id) as nb_cust_may from rentals_may
group by customer_id order by customer_id asc''', engine)
df1

     customer_id  nb_cust_may
0              1            9
1              2            2
2              3            6
3              4            6
4              5            8
..           ...          ...
593          595            3
594          596            8
595          597            5
596          598            1
597          599            5

[598 rows x 2 columns]

In [29]:
df2 = pd.read_sql('''select customer_id, count(rental_id) as nb_cust_june from rentals_june
group by customer_id order by customer_id asc''', engine)
df2

     customer_id  nb_cust_june
0              1             7
1              2             1
2              3             4
3              4             6
4              5             5
..           ...           ...
585          595             2
586          596             2
587          597             3
588          598             1
589          599             4

[590 rows x 2 columns]

## Write a function that checks if customer borrowed more or less films in the month of June as compared to May.
 
 **Hint**: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the [merge function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html).

In [31]:
daata = df1.merge(df2, right_index=True, left_index=True)
daata

     customer_id_x  nb_cust_may  customer_id_y  nb_cust_june
0                1            9              1             7
1                2            2              2             1
2                3            6              3             4
3                4            6              4             6
4                5            8              5             5
..             ...          ...            ...           ...
585            587            6            595             2
586            588            7            596             2
587            589            8            597             3
588            590            6            598             1
589            591            3            599             4

[590 rows x 4 columns]

In [35]:
daata["diff_june_may"] = daata["nb_cust_june"]-daata["nb_cust_may"]
daata

     customer_id_x  nb_cust_may  customer_id_y  nb_cust_june  diff_june_may
0                1            9              1             7             -2
1                2            2              2             1             -1
2                3            6              3             4             -2
3                4            6              4             6              0
4                5            8              5             5             -3
..             ...          ...            ...           ...            ...
585            587            6            595             2             -4
586            588            7            596             2             -5
587            589            8            597             3             -5
588            590            6            598             1             -5
589            591            3            599             4              1

[590 rows x 5 columns]